import '../models/quiz_question.dart';

const questions = [
  QuizQuestion(
    'アインシュタインが提唱した相対性理論の特殊相対性理論は、どのような現象を説明しますか？',
    [
      '重力の働き',
      '光の速度の一定性',
      '原子核の構造',
      '地球の自転運動',
    ],
  ),
  QuizQuestion('次のうち、哲学者アリストテレスが提唱したものはどれですか？', [
    '相対性理論',
    'ピタゴラスの定理',
    '地球が太陽の周りを公転すること',
    '科学的方法の基礎',
  ]),
  QuizQuestion(
    '地球上で最も高い山は次のうちどれですか？',
    [
      'エベレスト',
      'キリマンジャロ',
      'マッキンリー',
      'キャンプ・デビッド',
    ],
  ),
  QuizQuestion(
    '次のうち、最も多くの言語が話されている国はどれですか？',
    [
      'イギリス',
      'ドイツ',
      '中国',
      'ブラジル',
    ],
  ),
  QuizQuestion(
    'ダーウィンが提唱した進化論の中で、生物の適応に関する考え方を何と呼びますか？',
    [
      '自然淘汰',
      '突然変異',
      '遺伝子組み換え',
      '共生進化',
    ],
  ),
];
